<h2 align="center">.::Описание тестового задания::.</h2>
<hr color="red"/>
<br/>
<p>
    <b>Создать приложение-задачник.</b><br/>
    Задачи состоят из:
    <ul>
        <li>имени пользователя</li>
        <li>е-mail</li>
        <li>текста задачи</li>
        <li>картинки</li>
    </ul>
</p>
<br/>
<p>
    Требования к изображениям - формат JPG/GIF/PNG, не более 320х240 пикселей.<br/>
    При попытке загрузить изображение большего размера, картинка должна быть пропорционально уменьшена до заданных размеров.<br/>
</p>
<br/>
<p>
    Создавать новые задачи может любой посетитель.<br/>
    Перед сохранением новой задачи можно нажать "Предварительный просмотр", он должен работать без перезагрузки страницы.<br/>
</p>
<br/>
<p>
    Сделайте вход для администратора (логин "admin", пароль "123").<br/>
    Администратор имеет возможность редактировать текст задачи и поставить галочку о выполнении.<br/>
    Выполненные задачи в общем списке выводятся с соответствующей отметкой.<br/>
</p>
<br/>
<p>
    В списке задач нужно сделать возможность сортировки по имени пользователя, email и статусу.<br/>
    Вывод задач нужно сделать страницами по 3 штуки (пагинация).<br/>
</p>
<br/>
<p>
    В приложении нужно с помощью чистого PHP реализовать модель MVC (PHP-фреймворки использовать нельзя).<br/>
</p>
<br/>